# Задача 4: Петя, Катя и Сережа делают из бумаги журавликов. Вместе они сделали S журавликов. 
#Сколько журавликов сделал каждый ребенок, если известно, что Петя и Сережа сделали одинаковое количество журавликов, 
#а Катя сделала в два раза больше журавликов, чем Петя и Сережа вместе?
# *Пример:*
# 6 -> 1  4  1
# 24 -> 4  16  4
#    60 -> 10  40  10
#    7 -> "Нельзя определить"

# sum=x+x+2*(x+x)=> 6x=sum

sum = int (input())
if (sum % 2 == 0):
    P = sum // 6 # чтобы определить сколько журавликов сделали Петя или Сережа, нужно найти х
    K = P * 4 # определяем сколько сделала журавлей Катя, ляэтогоколичество журавлей Пети или Сережи умножаем на 2, потом еще раз на два (в итоге на 4)
    S = sum // 6 # т.к. Сережа и Петя сделали одинаковое количество журавлей, количество журавлей сделанных Сережей вычисляется так же как и Пети
    print (P, K, S)
else:
    print ("Нельзя определить")
