# Задача 2: Найдите сумму цифр трехзначного числа.
# *Пример:*
# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0) |

abc = int(input())
c = abc % 10 # abc -> c, т.е. из трехзначного числа находим третью цифру
b = abc // 10 % 10 # abc -> b, т.е. из трехзначного числа находим вторую цифру
a = abc // 100 # abc -> a, находим первую цифру

print (a, b, c,)
print (a + b + c)