# Задача 6: Вы пользуетесь общественным транспортом? Вероятно, вы расплачивались за проезд и получали билет с номером. 
#Счастливым билетом называют такой билет с шестизначным номером, где сумма первых трех цифр равна сумме последних трех. 
#Т.е. билет с номером 385916 – счастливый, т.к. 3+8+5=9+1+6. Вам требуется написать программу, которая проверяет счастливость билета.

# *Пример:*
# 385916 -> yes
# 123456 -> no
#    001001 -> yes

abcdef = int (input())
a = abcdef // 1000 // 100 # число делим на 1000, чтобы отделить первую половину числа, например, число 385 916, мы отделили первую часть -> 385
b = abcdef // 1000 // 10 % 10
c = abcdef // 1000 % 10

d = abcdef % 1000 // 100
e = abcdef % 1000 // 10 % 10
f = abcdef % 1000 % 10
if (a + b + c == d + e + f):
    print ("yes")
else:
    print ("no")
