# Задача 8: Требуется определить, можно ли от шоколадки размером n × m долек отломить k долек, 
# если разрешается сделать один разлом по прямой между дольками 
# (то есть разломить шоколадку на два прямоугольника).

# *Пример:*
# 3 2 4 -> yes
# 3 2 1 -> no
m = int (input())
n = int (input())
k = int (input())
if (k % m  == 0 or k % n == 0) and (k < m*n): # k (количество отломленных долек) должно делиться без остатка на m и n, чтобы выполнялось условие => один разлом по прямой (горизонтали или вертикали). Также k должно быть меньше произведения m*n (общего количества долек в шоколадке), чтобы не получилось так, что количество отломленных долек (k) больше общего количества долек в шоколадке.
    print ("yes")
else: 
    print ("no")